Revit 2027 API
AnalysisDisplayLegend.Height Property
 The height, in sheet size, of the legend's rectangle
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
public:
property double Height {
	double get ();
	void set (double value);
}
member Height : float with get, set
Property Value
Double
See Also
Reference
AnalysisDisplayLegend Class
Autodesk.Revit.DB.Analysis Namespace